In [17]:
import pandas as pd
import numpy as np

# creating pandas series

In [18]:
lst = [1,2,3,4,5]

ser = pd.Series(lst)

In [28]:
np.random.seed(3)
arr = np.random.randint(1,20,(3,4))
arr = arr.flatten()

In [29]:
arr

array([11,  4,  9,  1, 11, 12, 10, 11,  7,  1, 13,  8])

# repeat reset_index functions

In [43]:
ser = pd.Series(arr)
print(ser)

0     11
1      4
2      9
3      1
4     11
5     12
6     10
7     11
8      7
9      1
10    13
11     8
dtype: int32

# accessing aggregate between astype

In [48]:
for i in ser:
    print(i)

11
4
9
1
11
12
10
11
7
1
13
8

In [64]:
ser.agg(['min','max','sum','mean','std']).astype("int")

min      1
max     13
sum     98
mean     8
std      4
dtype: int32

In [69]:
ser.between(8,11)

0      True
1     False
2      True
3     False
4      True
5     False
6      True
7      True
8     False
9     False
10    False
11     True
dtype: bool

# working with strings

In [72]:
s = ['raghu','ram','bittu','chinni','shruthi']

s = pd.Series(s)

In [73]:
s

0      raghu
1        ram
2      bittu
3     chinni
4    shruthi
dtype: object

In [76]:
print(s.str.upper())
print(s.str.lower())
print(s.str.title())

0      RAGHU
1        RAM
2      BITTU
3     CHINNI
4    SHRUTHI
dtype: object
0      raghu
1        ram
2      bittu
3     chinni
4    shruthi
dtype: object
0      Raghu
1        Ram
2      Bittu
3     Chinni
4    Shruthi
dtype: object

In [79]:
s.str.count('r')

0    1
1    1
2    0
3    0
4    1
dtype: int64

In [81]:
s.str.find('r')

0    0
1    0
2   -1
3   -1
4    2
dtype: int64

In [100]:
s = ['  raghu','ram','bittu','chinni','shruthi']

s = pd.Series(s)

In [101]:
s.str.len()

0    7
1    3
2    5
3    6
4    7
dtype: int64

# DATA FRAME

In [224]:
data = {'Name':['raghu','ram','bittu','chinni','shruthi'],'age': [22,21,20,19,18]}

df = pd.DataFrame(data)

In [225]:
df

      Name  age
0    raghu   22
1      ram   21
2    bittu   20
3   chinni   19
4  shruthi   18

In [226]:
# adding coloum 
df['numbers'] = [99,33,11,22,33]
df

      Name  age  numbers
0    raghu   22       99
1      ram   21       33
2    bittu   20       11
3   chinni   19       22
4  shruthi   18       33

In [227]:
lst = pd.Series([1,2,4,5])
df['luck'] = lst

In [143]:
df.loc[1:3,'Name':'luck']

     Name  age  numbers  luck
1     ram   21       33   2.0
2   bittu   20       11   4.0
3  chinni   19       22   5.0

In [153]:
df.iloc[2:4,: -1]

     Name  age  numbers
2   bittu   20       11
3  chinni   19       22

In [165]:
df

      Name  age  numbers  luck
0    raghu   22       99   1.0
1      ram   21       33   2.0
2    bittu   20       11   4.0
3   chinni   19       22   5.0
4  shruthi   18       33   NaN

In [171]:
df.drop('Name',axis = 1)

   age  numbers  luck
0   22       99   1.0
1   21       33   2.0
2   20       11   4.0
3   19       22   5.0
4   18       33   NaN

# DROP fun()

In [175]:
df.drop([0,2,4],axis = 0)

     Name  age  numbers  luck
1     ram   21       33   2.0
3  chinni   19       22   5.0

In [190]:
df

      Name  age  numbers  luck
0    raghu   22       99   1.0
1      ram   21       33   2.0
2    bittu   20       11   4.0
3   chinni   19       22   5.0
4  shruthi   18       33   NaN

In [189]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['Name', 'age', 'numbers', 'luck'], dtype='object')]

In [222]:
df

   numbers  luck
0       99    99
1       33    88
2       11    77
3       22    66
4       33    55

In [193]:
df.head(3)

    Name  age  numbers  luck
0  raghu   22       99   1.0
1    ram   21       33   2.0
2  bittu   20       11   4.0

In [232]:
df.drop('Name',axis =1,inplace = True)

In [233]:
df

   age  numbers  luck
0   22       99   1.0
1   21       33   2.0
2   20       11   4.0
3   19       22   5.0
4   18       33   NaN

In [234]:
def ad(i,j):
    return i+j
def sq(i):
    return i**2
df.pipe(add,1).pipe(sq)

   age  numbers  luck
0  529    10000   4.0
1  484     1156   9.0
2  441      144  25.0
3  400      529  36.0
4  361     1156   NaN

In [235]:
df.apply(sum)

age        100.0
numbers    198.0
luck         NaN
dtype: float64

In [236]:
df

   age  numbers  luck
0   22       99   1.0
1   21       33   2.0
2   20       11   4.0
3   19       22   5.0
4   18       33   NaN

In [240]:
df.sort_values(by = 'age',inplace = True)

In [241]:
df

   age  numbers  luck
4   18       33   NaN
3   19       22   5.0
2   20       11   4.0
1   21       33   2.0
0   22       99   1.0

In [242]:
df.sort_values(by = 'numbers')

   age  numbers  luck
2   20       11   4.0
3   19       22   5.0
4   18       33   NaN
1   21       33   2.0
0   22       99   1.0

In [244]:
df.reindex([1,0,2,3,4])

   age  numbers  luck
1   21       33   2.0
0   22       99   1.0
2   20       11   4.0
3   19       22   5.0
4   18       33   NaN

In [247]:
df.rename(index = { 1: 'raghu',2:'ram',3:'bittu',4:'shruthi',0:"chinni"})

         age  numbers  luck
shruthi   18       33   NaN
bittu     19       22   5.0
ram       20       11   4.0
raghu     21       33   2.0
chinni    22       99   1.0